[
  {
    "name": "amazon-linux-eks",
    "description": "The Amazon EKS optimized Amazon Linux AMI is built on top of Amazon Linux 2 (AL2) and Amazon Linux 2023 (AL2023). This image is configured to serve as the base image for Amazon EKS nodes."
  },
  {
    "name": "ambassador",
    "description": "Ambassador is a Kubernetes-native API gateway built on the Envoy Proxy. Ambassador simplifies the process of exposing, securing, and managing traffic to services in Kubernetes clusters, reducing challenges to implement complex networking scenarios in cloud-native environments."
  },
  {
    "name": "antrea",
    "description": "Antrea is a Kubernetes networking solution intended to be Kubernetes native. It operates at Layer 3/4 to provide networking and security services for a Kubernetes cluster, leveraging Open vSwitch as the networking data plane."
  },
  {
    "name": "appdynamics-collector",
    "description": "AppDynamics Collector is a component within the AppDynamics platform that gathers and processes telemetry data from applications, databases, or other monitored systems, and sends this data to the AppDynamics backend for analysis and visualization."
  },
  {
    "name": "appdynamics-operator",
    "description": "AppDynamics Operator is a Kubernetes-native component designed to manage and automate the deployment and configuration of AppDynamics monitoring agents within Kubernetes environments."
  },
  {
    "name": "argo-rollouts",
    "description": "Argo Rollouts is a Kubernetes controller and set of CRDs which provide advanced deployment capabilities such as blue-green, canary, canary analysis, experimentation, and progressive delivery features to Kubernetes."
  },
  {
    "name": "avi",
    "description": "AVI AKO is a Kubernetes operator which works as an ingress controller and performs Avi-specific functions in a Kubernetes environment with the Avi Controller. AKO is deployed as a pod in the cluster and translates the required Kubernetes objects to Avi objects and automates the implementation of ingresses/routes/services on the Service Engines (SE) via the Avi Controller."
  },
  {
    "name": "avi-ako",
    "description": "AVI AKO is a Kubernetes operator which works as an ingress controller and performs Avi-specific functions in a Kubernetes environment with the Avi Controller. AKO is deployed as a pod in the cluster and translates the required Kubernetes objects to Avi objects and automates the implementation of ingresses/routes/services on the Service Engines (SE) via the Avi Controller."
  },
  {
    "name": "aws-eks-calico",
    "description": "Calico is a networking and security solution that enables Kubernetes workloads and non-Kubernetes/legacy workloads to communicate seamlessly and securely. Calico consists of networking to secure network communication, and advanced network policy to secure cloud-native microservices/applications at scale."
  },
  {
    "name": "aws-alb",
    "description": "AWS Load Balancer Controller is a controller to help manage Elastic Load Balancers for a Kubernetes cluster. AWS Load Balancer Controller satisfies Kubernetes Ingress resources by provisioning Application Load Balancers. It also satisfies Kubernetes Service resources by provisioning Network Load Balancers."
  },
  {
    "name": "csi-aws-efs",
    "description": "The Amazon Elastic File System Container Storage Interface (CSI) Driver implements the CSI specification for container orchestrators to manage the lifecycle of Amazon EFS file systems. Amazon EFS CSI driver supports dynamic provisioning and static provisioning. "
  },
  {
    "name": "aws-eks-oidc",
    "description": "The AWS EKS OIDC pack provides the necessary configurations to configure your Identity Provider with the OIDC identity provider for Amazon EKS clusters."
  },
  {
    "name": "aws-ssm-agent",
    "description": "The AWS SSM Agent pack installs the Amazon Session Manager Agent on the nodes of your Amazon Kubernetes cluster. The agent enables you to manage your interact and automate takss through the AWS Systems Manager."
  },
  {
    "name": "canonical-apache2",
    "description": "The Apache HTTP Server Project is an effort to develop and maintain an open-source HTTP server for modern operating systems including UNIX and Windows. The goal of this project is to provide a secure, efficient and extensible server that provides HTTP services in sync with the current HTTP standards."
  },
  {
    "name": "canonical-charms-deployer",
    "description": "Juju is an open source orchestration engine for software operators that enables the deployment, integration and lifecycle management of applications at any scale, on any infrastructure using charms. A charm is an operator - business logic encapsulated in reusable software packages that automate every aspect of an application's life."
  },
  {
    "name": "canonical-juju-olm",
    "description": "The Juju controller is used to manage the software deployed through Juju, from deployment to upgrades to day-two operations. One Juju controller can manage multiple projects or workspaces, which in Juju are known as models"
  },
  {
    "name": "canonical-mysql",
    "description": "MySQL is a fast, multi-threaded, multi-user, and robust SQL database server. It is intended for mission-critical, heavy-load production systems and mass-deployed software. This pack uses the Canonical MySQL Docker image to deploy a MySQL database."
  },
  {
    "name": "canonical-postgres",
    "description": "PostgreSQL is a powerful, open source object-relational database system with over 35 years of active development that has earned it a strong reputation for reliability, feature robustness, and performance. This pack uses the Canonical PostgreSQL Docker image to deploy a PostgreSQL database."
  },
  {
    "name": "canonical-redis",
    "description": "Redis is an in-memory data store used by millions of developers as a cache, vector database, document database, streaming engine, and message broker. Redis has built-in replication and different levels of on-disk persistence. It supports complex data types (for example, strings, hashes, lists, sets, sorted sets, and JSON), with atomic operations defined on those data types. This pack uses the Canonical Redis Docker image to deploy a Redis database."
  },
  {
    "name": "calico-network-policy",
    "description": "Calico network policy provides a richer set of policy capabilities than what Kubernetes provides out-of-the-box. The Nework Policy provider includes: policy ordering/priority, deny rules, and more flexible match rules. While Kubernetes network policy applies only to pods, Calico network policy can be applied to multiple types of endpoints including pods, VMs, and host interfaces. Finally, when used with Istio service mesh, Calico network policy supports securing applications layers 5-7 match criteria, and cryptographic identity."
  },
  {
    "name": "calico-networking",
    "description": "Calico network policy provides a richer set of policy capabilities than what Kubernetes provides out-of-the-box. The Nework Policy provider includes: policy ordering/priority, deny rules, and more flexible match rules. While Kubernetes network policy applies only to pods, Calico network policy can be applied to multiple types of endpoints including pods, VMs, and host interfaces. Finally, when used with Istio service mesh, Calico network policy supports securing applications layers 5-7 match criteria, and cryptographic identity."
  },
  {
    "name": "centos-aws",
    "description": "CentOS Linux distribution is a stable, predictable, manageable and reproducible platform derived from the sources of RedHat Enterprise Linux (RHEL). It provides a rich base platform for open-source communities to build upon."
  },
  {
    "name": "centos-azure",
    "description": "CentOS Linux distribution is a stable, predictable, manageable and reproducible platform derived from the sources of RedHat Enterprise Linux (RHEL). It provides a rich base platform for open-source communities to build upon."
  },
  {
    "name": "centos-gcp",
    "description": "CentOS Linux distribution is a stable, predictable, manageable and reproducible platform derived from the sources of RedHat Enterprise Linux (RHEL). It provides a rich base platform for open-source communities to build upon."
  },
  {
    "name": "centos-vsphere",
    "description": "CentOS Linux distribution is a stable, predictable, manageable and reproducible platform derived from the sources of RedHat Enterprise Linux (RHEL). It provides a rich base platform for open-source communities to build upon."
  },
  {
    "name": "ceph-rbd",
    "description": "A Container Storage Interface (CSI) driver, provisioner, snapshotter, resizer and attacher for Ceph RBD."
  },
  {
    "name": "ceph-rbd-addon",
    "description": "A Container Storage Interface (CSI) driver, provisioner, snapshotter, resizer and attacher for Ceph RBD."
  },
  {
    "name": "certmanager",
    "description": "cert-manager adds certificates and certificate issuers as resource types in Kubernetes clusters, simplifying obtaining, renewing, and using those certificates. It can issue certificates from various supported sources, including Let’s Encrypt, HashiCorp Vault, Venafi, and private PKI. It also takes care of the certificate validity and attempts to renew certificates before expiry."
  },
  {
    "name": "cisco-appdynamics-collectors",
    "description": "AppDynamics Collector is a component within the AppDynamics platform that gathers and processes telemetry data from applications, databases, or other monitored systems, and sends this data to the AppDynamics backend for analysis and visualization."
  },
  {
    "name": "cisco-appdynamics-operators",
    "description": "AppDynamics Operator is a Kubernetes-native component designed to manage and automate the deployment and configuration of AppDynamics monitoring agents within Kubernetes environments."
  },
  {
    "name": "cloudanix",
    "description": "The Cloudanix pack is an add-on security pack that provides a dashboard to help you detect threats and unusual behavior in your Kubernetes clusters. Cloudanix detects the following: Files added or modified in sensitive directories.  SSH into a container. Modifications to shell configuration files. Attempts to read sensitive files that contain credential information. And identitfy crypto mining."
  },
  {
    "name": "cni-azure",
    "description": "The Azure CNI plugin provides network support to Azure Kubernetes Service (AKS) clusters. The plugin is responsible for setting up the network interfaces on the nodes and pods, and for managing the IP addresses. The CNI ensures every pod gets an IP address from the subnet and can be accessed directly."
  },
  {
    "name": "cni-aws-vpc-eks",
    "description": "The Amazon Virtual Private Cloud (VPC) CNI plugin for Kubernetes. This plugin provides pod networking through Elastic Network Interfaces (ENI) for clusters deployed on AWS."
  },
  {
    "name": "cni-aws-vpc-eks-helm",
    "description": "The Amazon Virtual Private Cloud (VPC) CNI plugin for Kubernetes. This plugin provides pod networking through Elastic Network Interfaces (ENI) for clusters deployed on AWS."
  },
  {
    "name": "cni-calico",
    "description": "Calico is a networking and security solution that enables Kubernetes workloads and non-Kubernetes/legacy workloads to communicate seamlessly and securely. Calico consists of networking to secure network communication, and advanced network policy to secure cloud-native microservices/applications at scale."
  },
  {
    "name": "cni-calico-azure",
    "description": "Calico is a networking and security solution that enables Kubernetes workloads and non-Kubernetes/legacy workloads to communicate seamlessly and securely. Calico consists of networking to secure network communication, and advanced network policy to secure cloud-native microservices/applications at scale."
  },
  {
    "name": "cni-kubenet",
    "description": "Kubenet, a basic Kubernetes network plugin, configures pod network interfaces and routes using CNI plugins. It assigns IP addresses from a node-specific subnet, enabling pod-to-pod communication within nodes and relies on host network configurations for inter-node traffic."
  },
  {
    "name": "cni-multus",
    "description": "Multus CNI is a container network interface plugin for Kubernetes that enables attaching multiple network interfaces to pods. Typically, in Kubernetes each pod only has one network interface,apart from a loopback. With Multus you can create a multi-homed pod that has multiple interfaces. This is accomplished by Multus acting as a meta-plugin, a CNI plugin that can call multiple other CNI plugins."
  },
  {
    "name": "cni-romana",
    "description": "Romana is a new Software Defined Network (SDN) solution specifically designed for the Cloud Native architectural style. The result of this focus is that Romana cloud networks are less expensive to build, simpler to operate and deliver higher performance than cloud networks built using alternative SDN designs."
  },
  {
    "name": "cni-tke-global-router",
    "description": "This pack deploys the TKE Global Router CNI plugin, which provides a global routing solution for Kubernetes clusters. The plugin is designed to work with the TKE Global Router controller to provide a global routing solution for Kubernetes clusters."
  },
  {
    "name": "cni-vpc-native-gke",
    "description": "This pack deploys the GKE Container Network Interface (CNI) that provides network support to Google Kubernetes Engine (GKE) clusters. The CNI plugin is responsible for setting up the network interfaces on the nodes and pods, and for managing the IP addresses."
  },
  {
    "name": "cni-weavenet",
    "description": "WeaveNet, a Kubernetes CNI plugin, uniquely creates a resilient virtual network for pod communication across clusters with zero configuration. It supports encryption, network policies, multicast, and automatic IP allocation, making it ideal for secure and scalable environments."
  },
  {
    "name": "centos",
    "description": "CentOS Linux distribution is a stable, predictable, manageable and reproducible platform derived from the sources of RedHat Enterprise Linux (RHEL). It provides a rich base platform for open source communities to build upon. Spectro Cloudprovides CentOS as a development framework for its users."
  },
  {
    "name": "cni-flannel",
    "description": "Flannel is a network layer, layer three, fabric for Kubernetes. It is designed to work with Linux routing infrastructure and creates a virtual network that gives each computing host a subnet. Flannel uses either the Kubernetes API or etcd directly to store the network configuration, the allocated subnets, and any auxiliary data such as the host’s public IP address."
  },
  {
    "name": "csi-azure",
    "description": "Azure Disk CSI Driver allows Kubernetes to access Azure Disk volumes. The driver is implemented as a Container Storage Interface (CSI) plugin."
  },
  {
    "name": "csi-gcp",
    "description": "The Google Compute Engine Persistent Disk (GCE PD) Container Storage Interface (CSI) Storage Plugin. You can use the GCE PD CSI driver to manage the lifecycle of GCE PD volumes."
  },
  {
    "name": "csi-gcp-driver",
    "description": "The Google Compute Engine Persistent Disk (GCE PD) Container Storage Interface (CSI) Storage Plugin. You can use the GCE PD CSI driver to manage the lifecycle of GCE PD volumes. This pack supports Google IaaS clusters."
  },
  {
    "name": "gke-csi-gcp-driver",
    "description": "The Google Compute Engine Persistent Disk (GCE PD) Container Storage Interface (CSI) Storage Plugin. You can use the GCE PD CSI driver to manage the lifecycle of GCE PD volumes. This pack supports Google GKE clusters."
  },
  {
    "name": "csi-local-path-provisioner",
    "description": "Local Path Provisioner provides a way for the Kubernetes users to utilize the local storage in each node. Based on the user configuration, the Local Path Provisioner will create either hostPath or local based persistent volume on the node automatically"
  },
  {
    "name": "csi-local-path-provisioner-addon",
    "description": "Local Path Provisioner provides a way for the Kubernetes users to utilize the local storage in each node. Based on the user configuration, the Local Path Provisioner will create either hostPath or local based persistent volume on the node automatically"
  },
  {
    "name": "csi-longhorn",
    "description": "Longhorn is a lightweight distributed block storage system for cloud native storage Kubernetes that allows you to replicate storage to Kubernetes clusters. Once Longhorn is installed, it adds persistent volume support to the Kubernetes cluster using containers and microservices."
  },
  {
    "name": "csi-longhorn-addon",
    "description": "Longhorn is a lightweight distributed block storage system for cloud native storage Kubernetes that allows you to replicate storage to Kubernetes clusters. Once Longhorn is installed, it adds persistent volume support to the Kubernetes cluster using containers and microservices."
  },
  {
    "name": "csi-maas-volume",
    "description": "The MAAS Volume CSI driver allows Kubernetes to access MAAS volumes. The driver is implemented as a Container Storage Interface (CSI) plugin."
  },
  {
    "name": "csi-nfs",
    "description": "The NFS Container Storage Interface (CSI) Driver provides a CSI interface used by Kubernetes to manage the lifecycle of NFS volumes."
  },
  {
    "name": "csi-nfs-subdir-external",
    "description": "NFS subdir external provisioner is an automatic provisioner that use your existing and already configured NFS server to support dynamic provisioning of Kubernetes Persistent Volumes via Persistent Volume Claims."
  },
  {
    "name": "csi-openstack-cinder",
    "description": "The Cinder CSI Driver is a CSI Specification compliant driver used by Container Orchestrators to manage the lifecycle of OpenStack Cinder Volumes."
  },
  {
    "name": "csi-portworx-aws",
    "description": "The Portworx CSI Driver provides a standardized way to manage storage resources in containerized environments. This driver supports the full range of Portworx features and most of the CSI specifications, facilitating seamless integration and management of storage across different platforms."
  },
  {
    "name": "csi-portworx-gcp",
    "description": "The Portworx CSI Driver provides a standardized way to manage storage resources in containerized environments. This driver supports the full range of Portworx features and most of the CSI specifications, facilitating seamless integration and management of storage across different platforms."
  },
  {
    "name": "csi-portworx-generic",
    "description": "Portworx Enterprise provides a standardized way to manage storage resources in containerized environments. This driver supports the full range of Portworx features and most of the CSI specifications, facilitating seamless integration and management of storage across different platforms."
  },
  {
    "name": "csi-portworx-vsphere",
    "description": "The Portworx CSI Driver provides a standardized way to manage storage resources in containerized environments. This driver supports the full range of Portworx features and most of the CSI specifications, facilitating seamless integration and management of storage across different platforms."
  },
  {
    "name": "kubernetes",
    "description": "Palette eXtended Kubernetes (PXK) is a customized version of the open-source Cloud Native Computing Foundation (CNCF) distribution of Kubernetes. This Kubernetes version can be deployed through Palette to all major infrastructure providers, public cloud providers, and private data center providers. This is the default distribution when deploying a Kubernetes cluster through Palette."
  },
  {
    "name": "edge-k8s",
    "description": "Palette eXtended Kubernetes (PXK-E) is a customized version of the open-source Cloud Native Computing Foundation (CNCF) distribution of Kubernetes for Edge devices. This Kubernetes version can be deployed Edge hosts. This is the default distribution when deploying Edge Kubernetes cluster through Palette."
  },
  {
    "name": "edge-native-opensuse",
    "description": "openSUSE is a free and open-source Linux distribution developed by the openSUSE project."
  },
  {
    "name": "portworx-add-on",
    "description": "Portworx Enterprise provides a standardized way to manage storage resources in containerized environments. This driver supports the full range of Portworx features and most of the CSI specifications, facilitating seamless integration and management of storage across different platforms."
  },
  {
    "name": "csi-rook-ceph",
    "description": "Rook is an open source cloud-native storage orchestrator, providing the platform, framework, and support for Ceph storage to natively integrate with cloud-native environments."
  },
  {
    "name": "csi-rook-ceph-addon",
    "description": "Rook is an open source cloud-native storage orchestrator, providing the platform, framework, and support for Ceph storage to natively integrate with cloud-native environments."
  },
  {
    "name": "csi-rook-ceph-helm",
    "description": "Rook is an open source cloud-native storage orchestrator, providing the platform, framework, and support for Ceph storage to natively integrate with cloud-native environments."
  },
  {
    "name": "csi-rook-ceph-helm-addon",
    "description": "Rook is an open source cloud-native storage orchestrator, providing the platform, framework, and support for Ceph storage to natively integrate with cloud-native environments."
  },
  {
    "name": "csi-rook",
    "description": "Rook is a cloud-native storage orchestrator for Kubernetes, providing the platform, framework, and support for a diverse set of storage solutions to natively integrate with cloud-native environments. Rook turns storage"
  },
  {
    "name": "csi-tke",
    "description": "The TKE CSI Driver provides support for Kubernetes clusters to use Tencent Cloud Block Storage."
  },
  {
    "name": "csi-topolvm",
    "description": "TopoLVM is a CSI plugin using LVM for Kubernetes. It can be considered as a specific implementation of local persistent volumes using CSI and LVM. TopoLVM supports dynamic volume provisioning from PVC, flexible volume capacity management, and enhances the scheduler to prefer nodes having a larger storage capacity."
  },
  {
    "name": "csi-topolvm-addon",
    "description": "TopoLVM is a CSI plugin using LVM for Kubernetes. It can be considered as a specific implementation of local persistent volumes using CSI and LVM. TopoLVM supports dynamic volume provisioning from PVC, flexible volume capacity management, and enhances the scheduler to prefer nodes having a larger storage capacity."
  },
  {
    "name": "csi-trident",
    "description": "Trident is a fully supported open source project maintained by NetApp. It has been designed from the ground up to help you meet your containerized applications' persistence demands using industry-standard interfaces, such as the Container Storage Interface (CSI)."
  },
  {
    "name": "csi-trident-addon",
    "description": "Trident is a fully supported open source project maintained by NetApp. It has been designed from the ground up to help you meet your containerized applications' persistence demands using industry-standard interfaces, such as the Container Storage Interface (CSI)."
  },
  {
    "name": "csi-vsphere-csi",
    "description": "The vSphere CSI Driver is a Kubernetes plugin that allows persistent storage for containerized workloads running on vSphere infrastructure. It enables dynamic provisioning of storage volumes and provides features like snapshots, cloning, and dynamic expansion of volumes. The vSphere CSI Driver replaces the in-tree vSphere volume plugin and offers integration with vSphere with better scale and performance."
  },
  {
    "name": "csi-vsphere",
    "description": "The vSphere CSI Driver is a Kubernetes plugin that allows persistent storage for containerized workloads running on vSphere infrastructure. It enables dynamic provisioning of storage volumes and provides features like snapshots, cloning, and dynamic expansion of volumes. The vSphere CSI Driver replaces the in-tree vSphere volume plugin and offers integration with vSphere with better scale and performance."
  },
  {
    "name": "csi-vsphere-volume",
    "description": "The Vsphere CSI Volume plugin uses in-tree vSphere volumes to provide persistent storage for containerized workloads deployed on vSphere infrastructure."
  },
  {
    "name": "csm-operator-addon",
    "description": "The Dell Container Storage Modules Operator is a Kubernetes Operator, which can be used to install and manage the CSI Drivers and CSM Modules provided by Dell for various storage platforms."
  },
  {
    "name": "custom_os",
    "description": "This pack supports the deployment of Operating Systems for additional infrastructure platforms, such as Nutanix."
  },
  {
    "name": "db-postgresql",
    "description": "PostgreSQL is a free and open-source relational database management system (RDBMS) emphasizing extensibility and SQL compliance. PostgreSQL features transactions with atomicity, consistency, isolation, durability (ACID) properties, automatically updatable views, materialized views, triggers, foreign keys, and stored procedures. It is supported on all major operating systems and handles a range of workloads from single machines to data warehouses or web services with many concurrent users."
  },
  {
    "name": "dex",
    "description": "Dex is an identity service to drive authentication for Kubernetes API Server through the OpenID Connect plugin. Clients such as kubectl can act on behalf of users who can log in to the cluster through any identity provider that dex supports."
  },
  {
    "name": "hello-universe",
    "description": "Hello Universe is a demo web application used to help users learn more about Palette and its features. It includes a click counter and funny Spectro Cloud-themed images."
  },
  {
    "name": "cockroachdb-operator",
    "description": "The CockroachDB Kubernetes Operator deploys CockroachDB on a Kubernetes cluster. You can use the Operator to manage the configuration of an active CockroachDB cluster."
  },
  {
    "name": "cost-analyzer",
    "description": "Kubecost is a cost monitoring and optimization application that offers real-time cost visibility and insights for Kubernetes clusters."
  },
  {
    "name": "aws-cluster-autoscaler",
    "description": "The AWS Cluster Autoscaler pack monitors the cluster workload and utilizes AWS autoscaling groups to dynamically provision or shut down nodes, maximizing the cluster's performance and making it more resilient to failures."
  },
  {
    "name": "consul",
    "description": "Consul is a service networking solution that enables teams to manage secure network connectivity between services and across on-prem and multi-cloud environments and runtimes. Consul offers service discovery, service mesh, traffic management, and automated updates to network infrastructure devices."
  },
  {
    "name": "cos-gke",
    "description": "Container-Optimized OS is an operating system image for your Compute Engine VMs that is optimized for deploying Docker containers. With Container-Optimized OS, you can bring up your Docker containers on Google Cloud Platform quickly, efficiently, and securely. Container-Optimized OS is maintained by Google and is based on the open source Chromium OS project."
  },
  {
    "name": "crossplane",
    "description": "Crossplane transforms Kubernetes clusters into universal control planes, extending the Kubernetes API and enabling infrastructure resource provisioning and management across major infrastructure providers."
  },
  {
    "name": "csi-aws",
    "description": "This Container Storage Interface (CSI) driver, provisioner, snapshotter, resizer, and attacher for Amazon Elastic Block Store (EBS) volumes enables Kubernetes to manage the lifecycle of EBS volumes."
  },
  {
    "name": "csi-aws-ebs",
    "description": "The Amazon Elastic Block Store Container Storage Interface (CSI) Driver provides a CSI interface used by Container Orchestrators to manage the lifecycle of Amazon EBS volumes."
  },
  {
    "name": "elastic-fluentd-kibana",
    "description": "This pack deploys an Elasticsearch, Fluentd and Kibana stack. Elasticsearch is a distributed, RESTful search and analytics engine capable of solving a growing number of use cases. Fluentd is an open-source data collector for unified logging layer. Kibana is an open-source data visualization dashboard for Elasticsearch."
  },
  {
    "name": "elastic-operator",
    "description": "Elastic Cloud on Kubernetes automates the deployment, provisioning, management, and orchestration of Elasticsearch, Kibana, APM Server, Enterprise Search, Beats, Elastic Agent, Elastic Maps Server, and Logstash on Kubernetes based on the operator pattern."
  },
  {
    "name": "elastic-stack",
    "description": "Elastic Cloud on Kubernetes automates the deployment, provisioning, management, and orchestration of Elasticsearch, Kibana, APM Server, Enterprise Search, Beats, Elastic Agent, Elastic Maps Server, and Logstash on Kubernetes based on the operator pattern."
  },
  {
    "name": "external-dns",
    "description": "ExternalDNS makes Kubernetes resources discoverable via public DNS servers. Like KubeDNS, it retrieves a list of resources, such as Services, Ingresses, etc, from the Kubernetes API to determine a desired list of DNS records. Unlike KubeDNS, however, it's not a DNS server but configures other DNS providers accordingly, such as AWS Route 53 or Google Cloud DNS. In a broader sense, ExternalDNS allows you to control DNS records dynamically via Kubernetes resources in a DNS provider-agnostic way."
  },
  {
    "name": "external-secrets",
    "description": "External Secrets is a tool integrates external secret management systems like AWS Secrets Manager, HashiCorp Vault, Google Secrets Manager, Azure Key Vault, IBM Cloud Secrets Manager, CyberArk Conjur and many more. The operator reads information from external APIs and automatically injects the values into a Kubernetes Secret."
  },
  {
    "name": "external-secrets-operator",
    "description": "External Secrets Operator is a Kubernetes operator that integrates external secret management systems like AWS Secrets Manager, HashiCorp Vault, Google Secrets Manager, Azure Key Vault, IBM Cloud Secrets Manager, CyberArk Conjur and many more. The operator reads information from external APIs and automatically injects the values into a Kubernetes Secret."
  },
  {
    "name": "external-snapshotter",
    "description": "External Snapshotter is a Kubernetes controller that watches Kubernetes Snapshot CRD objects and triggers CreateSnapshot/DeleteSnapshot against a CSI endpoint. It is used to create and delete volume snapshots in a Kubernetes cluster."
  },
  {
    "name": "falco",
    "description": "Falco is a cloud-native security tool designed for Linux systems. It employs custom rules on kernel events, which are enriched with container and Kubernetes metadata, to provide real-time alerts. Falco helps you gain visibility into abnormal behavior, potential security threats, and compliance violations, contributing to comprehensive runtime security."
  },
  {
    "name": "falcon-sensor",
    "description": "Falcon is the CrowdStrike platform purpose-built to stop breaches via a unified set of cloud-delivered technologies that prevent all types of attacks — including malware and more. "
  },
  {
    "name": "f5",
    "description": "F5 provides protocol and application traffic awareness for intelligent load balancing decisions. This pack deploys the F5 BIG-IP Controller for Kubernetes, which integrates with the F5 BIG-IP platform to provide advanced traffic management and security services for applications running in Kubernetes."
  },
  {
    "name": "fluentbit",
    "description": "Fluent Bit is a fast, lightweight, and highly scalable logging and metrics processor and forwarder. Fluentbit can process Kubernetes containers logs from the file system or Systemd/Journald. Enrich logs with Kubernetes Metadata, and centralize your logs in third party storage services like Elasticsearch, InfluxDB, HTTP, etc."
  },
  {
    "name": "flux-cd",
    "description": "Flux is a tool for keeping Kubernetes clusters in sync with sources of configuration, such as Git repositories, and automating updates to configuration when there is new code to deploy. Flux is built from the ground up to use Kubernetes' API extension system, and to integrate with Prometheus and other core components of the Kubernetes ecosystem. Flux supports multi-tenancy and support for syncing an arbitrary number of Git repositories."
  },
  {
    "name": "gatekeeper",
    "description": "Gatekeeper is a validating and mutating webhook that enforces CRD-based policies executed by Open Policy Agent, a policy engine for Cloud Native environments hosted by CNCF."
  },
  {
    "name": "generic-vm-vsphere",
    "description": "Generic-VM-vSphere is a Palette Add-on pack used to simplify deploying the virtual machine resource from a cluster profile or a system profile. Generic-VM-vSphere extracts all Terraform constructs inside the pack and exposes nothing but the values. Users will then have the ability to modify the add-on pack for the different applications."
  },
  {
    "name": "gloo",
    "descrption": "Gloo Gateway is a feature-rich, fast, and flexible Kubernetes-native ingress controller and next-generation API gateway that is built on top of Envoy proxy and the Kubernetes Gateway API. It excels in function-level routing, supports legacy apps, microservices and serverless, offers robust discovery capabilities, integrates seamlessly with open-source projects, and is designed to support hybrid applications with various technologies, architectures, protocols, and clouds."
  },
  {
    "name": "gvisor",
    "description": "gVisor is an open-source Linux-compatible sandbox that can be deployed anywhere existing container tooling does. It enables cloud-native container security and portability. gVisor leverages years of experience isolating production workloads at Google."
  },
  {
    "name": "karpenter",
    "description": "Karpenter is an open-source node lifecycle management project built for Kubernetes. Adding Karpenter to a Kubernetes cluster can dramatically improve the efficiency and cost of active workloads in the cluster. Karpenter automatically launches the right compute resources to handle your cluster's applications."
  },
  {
    "name": "kubernetes-microk8s",
    "description": "MicroK8s is a lightweight Kubernetes distribution developed by Canonical. It deploys all Kubernetes services in a single, fully contained package and offers out-of-the-box add-ons."
  },
  {
    "name": "kubernetes-aks",
    "description": "Kubernetes is a portable, extensible, open source platform for managing containerized workloads and services, that facilitates both declarative configuration and automation. It has a large, rapidly growing ecosystem. Kubernetes services, support, and tools are widely available."
  },
  {
    "name": "kubernetes-eks",
    "description": "Kubernetes is a portable, extensible, open source platform for managing containerized workloads and services, that facilitates both declarative configuration and automation. It has a large, rapidly growing ecosystem. Kubernetes services, support, and tools are widely available."
  },
  {
    "name": "kubernetes-gke",
    "description": "Kubernetes is a portable, extensible, open source platform for managing containerized workloads and services, that facilitates both declarative configuration and automation. It has a large, rapidly growing ecosystem. Kubernetes services, support, and tools are widely available."
  },
  {
    "name": "kubernetes-konvoy",
    "description": "Konvoy is built using upstream Kubernetes combined with all other required technologies and add-ons such as networking, storage, monitoring, logging, lifecycle management, using best of breed open source CNCF technologies. Konvoy comes with operational, security leading practices, testing and support for all of those technologies, and it works on virtual, bare metal, and public cloud infrastructure."
  },
  {
    "name": "kubernetes-tke",
    "description": "Kubernetes is a portable, extensible, open source platform for managing containerized workloads and services, that facilitates both declarative configuration and automation. It has a large, rapidly growing ecosystem. Kubernetes services, support, and tools are widely available."
  },
  {
    "name": "kubernetes-custom",
    "description": "Kubernetes is a portable, extensible, open source platform for managing containerized workloads and services, that facilitates both declarative configuration and automation. It has a large, rapidly growing ecosystem. Kubernetes services, support, and tools are widely available."
  },
  {
    "name": "kubernetes-rke2",
    "description": "RKE2, also known as RKE Government, is Rancher's next-generation Kubernetes distribution. RKE2 is a fully conformant Kubernetes distribution that focuses security and compliance within the U.S. Federal Government sector."
  },
  {
    "name": "kubernetes-ck8s",
    "description": "Canonical Kubernetes delivers the Canonical Kubernetes distribution for MAAS environments in controller mode, enabling consistent, automated cluster operations. It provides a secure and stable Kubernetes stack that simplifies deployment and lifecycle management when used with Palette."
  },
  {
    "name": "edge-canonical",
    "description": "Palette Optimized Canonical delivers the Canonical Kubernetes distribution for edge environments, enabling consistent, automated cluster operations. It provides a secure and stable Kubernetes stack that simplifies deployment and lifecycle management when used with Palette."
  },
  {
    "name": "edge-rke2",
    "description": "RKE2, also known as RKE Government, is Rancher's next-generation Kubernetes distribution. RKE2 is a fully conformant Kubernetes distribution that focuses security and compliance within the U.S. Federal Government sector."
  },
  {
    "name": "edge-microk8s",
    "description": "MicroK8s is a lightweight Kubernetes distribution developed by Canonical. It deploys all Kubernetes services in a single, fully contained package and offers out-of-the-box add-ons."
  },
  {
    "name": "lb-metallb",
    "description": "MetalLB is a load balancer implementation for bare metal Kubernetes clusters that use standard routing protocols."
  },
  {
    "name": "lb-metallb-helm",
    "description": "MetalLB is a load balancer implementation for bare metal Kubernetes clusters that use standard routing protocols."
  },
  {
    "name": "ngrok-ingress-controller",
    "description": "The ngrok Ingress Controller provides secure internet access to Kubernetes workloads by offloading network ingress and middleware execution to ngrok's platform."
  },
  {
    "name": "nutanix-csi",
    "description": "The Nutanix CSI pack uses Nutanix Volumes and Nutanix Files to provide persistent storage for stateful applications."
  },
  {
    "name": "argo-cd",
    "description": "Argo CD is a declarative continuous delivery tool for Kubernetes. It automates the deployment of the desired application states in the specified target environments using Git repositories as the source of truth."
  },
  {
    "name": "cni-cilium-oss",
    "description": "Cilium is an open-source software for securing and observing network connectivity between cloud-native container workloads."
  },
  {
    "name": "edge-k3s",
    "description": "K3s is a lightweight distribution of Kubernetes that is specifically designed for resource-constrained environments and Internet of Things (IoT) applications."
  },
  {
    "name": "edge-k8s",
    "description": "Palette eXtended Kubernetes - Edge (PXK-E) is a customized version of the open-source Cloud Native Computing Foundation (CNCF) distribution of Kubernetes. This Kubernetes distribution is customized and optimized for edge computing environments and can be deployed through Palette."
  },
  {
    "name": "edge-native-byoi",
    "description": "The Bring Your Own Operating System (BYOOS) pack enables you to use a custom Operating System (OS) when using Agent Mode or deploying  Edge clusters."
  },
  {
    "name": "generic-byoi",
    "description": "The Bring Your Own Operating System (BYOOS) pack enables you to use a custom Operating System (OS) with Palette clusters."
  },
  {
    "name": "harbor-edge-native-config",
    "description": "Harbor is an open-source registry that secures artifacts with policies and role-based access control. You can install Harbor on your Edge clusters and use it to store all the images used by the cluster, including your provider images and packs."
  },
  {
    "name": "harbor",
    "description": "Harbor is an open-source registry that secures artifacts with policies and role-based access control. You can install Harbor on your clusters and use it to store all the images and packs used by the cluster."
  },
  {
    "name": "nginx",
    "description": "The NGNIX pack is an Ingress Controller implementation that uses NGINX as a reverse proxy and load balancer. It provides services with externally reachable URLs, offers SSL/TLS termination, load balances traffic, and supports name-based virtual hosting."
  },
  {
    "name": "local-ai",
    "description": "LocalAI is an open-source alternative to OpenAI that enables you to run LLMs and generate images and audio locally using consumer-grade hardware. It supports multiple model families."
  },
  {
    "name": "minio",
    "description": "MinIO is a Kubernetes-native high-performance object store with an S3-compatible API."
  },
  {
    "name": "nvidia-gpu-operator",
    "description": "The NVIDIA GPU Operator automates the management of the NVIDIA software components required for GPU provisioning. This allows Kubernetes cluster administrators to manage GPU nodes in the same way as CPU nodes."
  },
  {
    "name": "oam-app-controller",
    "description": "The OAM App Controller is a set of packs used for deploying Open Application Model (OAM) applications. It comprises the App-core, Flux2, and Zot packs."
  },
  {
    "name": "opensuse-k3s",
    "description": "SUSE K3s is a SUSE offering for K3s, a lightweight yet powerful certified Kubernetes distribution designed for production workloads across resource-restrained, remote locations or on Edge IoT devices."
  },
  {
    "name": "open-policy-agent",
    "description": "Open Policy Agent (OPA) Gatekeeper provides an admission control system based on policies or rules implemented through parameterized and admin configurable constraints."
  },
  {
    "name": "outcold-monitoring",
    "description": "Outcold Solutions is a Kubernetes monitoring solution integrated with Splunk. It includes capabilities for log aggregation, cluster health monitoring, application monitoring, and security auditing."
  },
  {
    "name": "kubesec",
    "description": "Kubesec provides security risk analysis for Kubernetes resources. It identifies misconfigurations and generates recommendations to improve the security of Pods, Deployments, and other resources."
  },
  {
    "name": "kubevious",
    "description": "Kubevious is a cloud-native best practices and configuration validation enforcement tool for Kubernetes clusters and applications. It detects and enforces custom policies and conditions within your clusters."
  },
  {
    "name": "kubevirt",
    "description": "KubeVirt is a virtual machine management add-on that allows the management of virtual machine workloads alongside container workloads within a Kubernetes cluster."
  },
  {
    "name": "kubevirt-cdi",
    "description": "The KubeVirt Containerized Data Importer (CDI) provides facilities for enabling Persistent Volume Claims (PVCs) to be used as disks for KubeVirt VMs via DataVolumes."
  },
  {
    "name": "kubewatch",
    "description": "Kubewatch is a Kubernetes watcher that monitors the cluster for resource changes and publishes notifications to available collaboration hubs and notification channels."
  },
  {
    "name": "lb-citrix-adc",
    "description": "Citrix ADC is an application delivery controller (ADC) solution that offers IP address management and load balancing capabilities for external services deployed on Kubernetes clusters, particularly suited for on-premise deployments."
  },
  {
    "name": "linkerd",
    "description": "Linkerd is a service mesh for Kubernetes that provides runtime debugging, observability, reliability, and security without requiring code changes."
  },
  {
    "name": "newrelic",
    "description": "New Relic is an observability platform designed to provide real-time insights into the performance and behavior of digital systems. It allows you to monitor applications, infrastructure, web browsers, and other components."
  },
  {
    "name": "permission-manager",
    "description": "The Permission Manager pack provides a graphical user interface for RBAC management in Kubernetes. It allows you to create users, assign namespaces and permissions, and distribute Kubeconfig YAML files."
  },
  {
    "name": "palette-upgrader",
    "description": "The Palette Upgrader pack enables you to manage the Palette upgrade version of Edge-virtual clusters."
  },
  {
    "name": "pfsense-vm-vsphere",
    "description": "pfSense is an open-source customized distribution of the FreeBSD operating system designed for use as a firewall and router in vSphere VMs."
  },
  {
    "name": "datadog",
    "description": "Datadog is an observability platform that offers a variety of application monitoring capabilities for servers, databases, tools, and services."
  },
  {
    "name": "prismacloud",
    "description": "Prisma Cloud Compute is a cloud workload protection platform (CWPP) that protects hosts, containers, and serverless deployments in any cloud at every stage of the software lifecycle. It provides security for tenant workloads regardless of the underlying compute technology or cloud environment."
  },
  {
    "name": "prometheus-agent",
    "description": "Prometheus is an open-source monitoring and alerting system that is designed to collect and analyze metrics from various systems and services. The Prometheus Agent pack works together with the Prometheus Operator pack."
  },
  {
    "name": "prometheus-operator",
    "description": "The Prometheus Operator is a tool that simplifies the deployment and management of Prometheus in a Kubernetes cluster. It automates tasks such as configuring Prometheus, creating and managing Prometheus rules and alerts and scaling Prometheus instances based on demand."
  },
  {
    "name": "qualys-agent",
    "description": "Qualys Cloud Agent is a lightweight cloud security agent that enables real-time, global visibility of IT assets and response."
  },
  {
    "name": "rbac-manager",
    "description": "Fairwinds RBAC Manager is an operator that supports declarative configuration for RBAC with new custom resources, simplifying authorization in Kubernetes."
  },
  {
    "name": "registry-creds",
    "description": "The Registry Credentials pack allows you to refresh AWS ECR, Google Registry, and Azure Container Registry credentials inside your Kubernetes cluster using ImagePullSecrets."
  },
  {
    "name": "reloader",
    "description": "Reloader is a Kubernetes controller that monitors changes in ConfigMaps and Secrets and performs rolling upgrades on Pods with their associated Deployments, StatefulSets, DaemonSets, and DeploymentConfigs."
  },
  {
    "name": "rhel-vmware",
    "description": "Red Hat Enterprise Linux (RHEL) is an enterprise Linux operating system (OS) developed by Red Hat. The RHEL pack is designed for VMware clusters."
  },
  {
    "name": "sapp-hipster",
    "description": "Hipster Commerce is a demo e-commerce application used to showcase Palette."
  },
  {
    "name": "seccomp",
    "description": "Seccomp (Secure Computing Mode) is a security mechanism for Linux processes that filters system calls (syscalls) based on a set of defined rules. You can apply seccomp profiles to containerized workloads to enhance the security of the application deployment."
  },
  {
    "name": "signalfx",
    "description": "SignalFx is a cloud monitoring platform for infrastructure, microservices, and applications. It allows you to monitor and observe data in real-time, regardless of the data source or type of application."
  },
  {
    "name": "slem-rke2",
    "description": "RKE2 is a fully conformant Kubernetes distribution by Rancher, focusing on security and compliance within the U.S. Federal Government sector. SLE Micro RKE2 is the RKE2 Kubernetes distribution suited for the SUSE Linux Enterprise (SLE) Micro edge operating system."
  },
  {
    "name": "spectro-byo-manifest",
    "description": "The BYO Manifest add-on pack enables you to add your own Kubernetes manifest to the pack's values field, allowing you to deploy your own custom applications."
  },
  {
    "name": "spectro-cluster-metrics",
    "description": "The Spectro Cluster Metrics pack exposes Palette-specific host cluster metrics to Prometheus. You can use this data to learn about the state of your clusters, resource utilization, and more."
  },
  {
    "name": "spectrocloud-grafana-dashboards",
    "description": "The Spectro Cloud Grafana Dashboards is a demo add-on pack that exposes internal cluster resource metrics. You can access the cluster information exposed by the pack in Grafana by visiting the Spectro Cloud/Spectro Clusters dashboard."
  },
  {
    "name": "spectro-grafana-dashboards",
    "description": "The Spectro Cloud Grafana Dashboards is an add-on pack that exposes internal cluster resource metrics. You can access the cluster information exposed by the pack in Grafana by visiting the Spectro Cloud/Spectro Clusters dashboard."
  },
  {
    "name": "heartbeat",
    "description": "Heartbeat is a lightweight daemon that periodically checks the status of your services and determines whether they are reachable."
  },
  {
    "name": "image-swap",
    "description": "The ImageSwap pack is a webhook that allows you to define mappings to automatically swap image definitions within Kubernetes Pods with a different registry."
  },
  {
    "name": "istio",
    "description": "Istio is an open-source service mesh that layers transparently onto existing distributed applications. It helps you to secure, connect, and monitor services."
  },
  {
    "name": "k8gb",
    "description": "k8gb is an open-source global load balancing solution for Kubernetes. It focuses on load balancing traffic across geographically dispersed Kubernetes clusters using different load balancing strategies."
  },
  {
    "name": "k8sgpt-operator",
    "description": "The K8sGPT Operator enables K8sGPT within a Kubernetes cluster. K8sGPT is a tool that continuously scans your Kubernetes clusters for anomalies. It analyzes cluster data and uses AI engines to provide insights and recommendations."
  },
  {
    "name": "konvoy-defaultstorageclass",
    "description": "The Konvoy Default Storage Class pack enables users to specify a default storage class for applications that require persistent storage."
  },
  {
    "name": "konvoy-nvidia",
    "description": "The NVIDIA GPU Plugin pack enables the NVIDIA device plugin in Konvoy clusters."
  },
  {
    "name": "konvoy-opsportal",
    "description": "Konvoy Operations Portal is a web application that provides an overview of cluster status and shortcuts to several dashboards for add-on services, such as Grafana."
  },
  {
    "name": "kong",
    "description": "Kong Ingress Controller allows you to run Kong Gateway as a Kubernetes Ingress to handle inbound requests for a Kubernetes cluster."
  },
  {
    "name": "k8s-dashboard",
    "description": "Kubernetes Dashboard is a web-based Kubernetes UI that allows users to monitor and manage clusters and deployed workloads."
  },
  {
    "name": "kotsadm",
    "description": "Kotsadm is an admin console designed for managing Kubernetes Off-The-Shelf (KOTS) software. Once deployed, Kotsadm enables administrators to configure, install, and update applications using step-through configuration and automated preflight checks."
  },
  {
    "name": "kube-bench",
    "description": "kube-bench is a tool that checks whether Kubernetes is deployed securely by running the checks documented in the CIS Kubernetes Benchmark."
  },
  {
    "name": "kubeflow",
    "description": "Kubeflow is the machine learning toolkit for Kubernetes. It helps make the deployment of machine learning (ML) workflows on Kubernetes simple, portable, and scalable."
  },
  {
    "name": "kubeflow-full",
    "description": "The Kubeflow Full pack offers the complete suite of Kubeflow components bundled together."
  },
  {
    "name": "kubeflow-pipelines",
    "description": "Kubeflow Pipelines is a platform for building and deploying portable, scalable machine learning (ML) workflows based on Docker containers."
  },
  {
    "name": "kubeflow-serving",
    "description": "The Kubeflow Serving pack provides a Kubernetes Custom Resource Definition (CRD) for serving predictive and generative Machine Learning (ML) models."
  },
  {
    "name": "kubeflow-training",
    "description": "The Kubeflow Training Operator is a Kubernetes-native project for fine-tuning and scalable distributed training of Machine Learning (ML) models created with various ML frameworks. It allows you to use Kubernetes workloads to train your large models via Kubernetes Custom Resources APIs or using the Training Operator Python Software Development Toolkit (SDK)."
  },
  {
    "name": "kubehunter",
    "description": "Kube-hunter searches for security weaknesses in Kubernetes clusters. It is designed to increase awareness and visibility of security issues in Kubernetes environments."
  },
  {
    "name": "kubebench",
    "description": "kube-bench is a tool that checks whether Kubernetes is deployed securely by running the checks documented in the CIS Kubernetes Benchmark."
  },
  {
    "name": "registry-connect",
    "description": "The Registry Connect Pack enables seamless integration with OCI-compliant registries. This pack allows you to bring your own registry to use as an in-cluster primary registry while maintaining compatibility with the deployment model of Palette Edge."
  },
  {
    "name": "spectro-proxy",
    "description": "Spectro Proxy is a pack that enables the use of a reverse proxy with a Kubernetes cluster. The reverse proxy allows you to connect to the cluster API of a Palette-managed Kubernetes cluster in private networks or clusters configured with private API endpoints. The reverse proxy managed by Spectro Cloud is also known as the forward reverse proxy (FRP)."
  },
  {
    "name": "spectro-k8s-dashboard",
    "description": "This pack deploys the Kubernetes Dashboard, and the Spectro Proxy if needed. The pack reduces the complexity of deploying the Kubernetes Dashboard by creating required resources and roles."
  },
  {
    "name": "spectro-rbac",
    "description": "The Spectro RBAC pack is a helper pack to create roleBindings and clusterRoleBindings for a user or service account in a Kubernetes cluster."
  },
  {
    "name": "spectro-namespace-labeler",
    "description": "The Spectro Namespace Labeler pack is a helper pack to add labels to a namespace in a Kubernetes cluster."
  },
  {
    "name": "spectro-nodes-task-handler",
    "description": "The Spectro Nodes Task Handler pack is tool you can use to perform tasks on nodes in a Kubernetes cluster post-initailization. For example, you can use it to install software, or modify default settings, and more."
  },
  {
    "name": "spectro-pack-status-check",
    "description": "This pack invokes a script that reads a timeout from the YAML file provided, calculates the number of attempts, and repeatedly checks the status of specified Kubernetes resources against expected conditions. If a resource meets the condition within the attempts, it exits successfully; otherwise, it fa"
  },
  {
    "name": "spegel",
    "description": "Spegel is a local OCI registry mirror for Kubernets clusters. You can use it to locally cache images from external registries with no explicit configuration, and more."
  },
  {
    "name": "splunk",
    "description": "This pack deploys Splunk Connect for Kubernetes. Splunk Connect for Kubernetes provides a way to import and search your Kubernetes logging, object, and metrics data in your Splunk platform deployment."
  },
  {
    "name": "spotinst-kubernetes-cluster-controller",
    "description": "Ocean automates cloud infrastructure for containers. It continuously analyzes how your containers are using infrastructure, automatically scaling compute resources to maximize utilization and availability and utilizing the optimal blend of spot, reserved, and on-demand compute instances. Ocean eliminates the need to manage and operate cloud infrastructure."
  },
  {
    "name": "sr-iov",
    "description": "SR-IOV is a CNI plugin that enables the configuration and usage of SR-IOV VF networks in containers and orchestrators like Kubernetes."
  },
  {
    "name": "strimzi-kafka",
    "description": "Strimzi provides a way to deploy an Apache Kafka® cluster on Kubernetes in various deployment configurations. "
  },
  {
    "name": "suc",
    "description": "System Upgrade Controller, is a general-purpose, Kubernetes-native upgrade controller for Kubernetes nodes developed by Rancher. It introduces a new CRD, the Plan, for defining any and all of your upgrade policie and requirements. A Plan is an outstanding intent to mutate nodes in your cluster."
  },
  {
    "name": "sumologic",
    "description": "The Sumo Logic Kubernetes app provides visibility into the worker nodes that comprise a cluster, as well as application logs of the worker nodes. The app is a single-pane-of-glass through which you can monitor and troubleshoot container health, replication, load balancing, pod state and hardware resource allocation."
  },
  {
    "name": "sysdig",
    "description": "Sysdig is a monitoring, security, and troubleshooting platform for cloud-native applications. Sysdig provides deep visibility into containerized applications, allowing you to monitor, secure, and troubleshoot your Kubernetes environment."
  },
  {
    "name": "stormforge-optimize-live",
    "description": "StormForge Optimize Live is a Kubernetes-native performance optimization platform that uses machine learning to automatically tune your applications for performance, cost, and resource efficiency."
  },
  {
    "name": "tekton-chains",
    "descriptions": "Tekton Chains is a Kubernetes Custom Resource Definition (CRD) controller that allows you to manage your supply chain security in Tekton. In its default mode of operation, Chains works by observing all TaskRuns executions in your cluster. When TaskRuns complete, Chains takes a snapshot of them. Chains then converts this snapshot to one or more standard payload formats, signs them and stores where specified."
  },
  {
    "name": "tekton-operator",
    "description": "Tekton Operator is a Kubernetes extension that can install, upgrade and manage TektonCD Pipelines, Dashboard, Triggers and other components, on any Kubernetes Cluster."
  },
  {
    "name": "tetragon",
    "description": "Tetragon is a flexible Kubernetes-aware security observability and runtime enforcement tool that applies policy and filtering directly with eBPF, allowing for reduced observation overhead, tracking of any process, and real-time enforcement of policies."
  },
  {
    "name": "tke-managed-os",
    "description": "TKE Managed OS is a pack that provides a managed operating system for Tencent Kubernetes Engine (TKE) clusters. The pack includes the operating system and the necessary configurations to deploy the TKE cluster."
  },
  {
    "name": "thanos",
    "description": "Thanos is a set of components that can be composed into a highly available metric system with unlimited storage capacity, which can be added seamlessly on top of existing Prometheus deployments. Thanos leverages the Prometheus 2.0 storage format to cost-efficiently store historical metric data in any object storage while retaining fast query latencies."
  },
  {
    "name": "triliovault",
    "description": "Trilio for Kubernetes is a data protection and backup solution specifically designed for Kubernetes environments. Trilio provides backup and recovery capabilities tailored for these dynamic, container-based infrastructures."
  },
  {
    "name": "trivy",
    "description": "Trivy is a simple and comprehensive vulnerability, misconfiguration, secret scanner for containers and other artifacts. Trivy detects vulnerabilities of OS packages and language-specific packages. In addition, Trivy scans Infrastructure as Code (IaC) files such as Terraform and Kubernetes, to detect potential configuration issues that expose your deployments to the risk of attack."
  },
  {
    "name": "trow",
    "description": "Trow is an image management service for Kubernetes that allows you to store, manage, and distribute container images in your cluster. Trow provides a secure, private registry for your Kubernetes cluster, allowing you to store images locally and distribute them across your cluster."
  },
  {
    "name": "Twistlock",
    "description": "Twistlock is a comprehensive container security solution designed specifically for Kubernetes and other container environments. Twistlock provides end-to-end security for containerized applications running on Kubernetes, covering the entire container lifecycle from development to production."
  },
  {
    "name": "ubuntu-aws",
    "description": "Ubuntu is a free, open-source operating system (OS) based on Linux that can be used on desktops, servers, in the cloud, and for IoT devices. Ubuntu is a Linux distribution derived from Debian."
  },
  {
    "name": "ubuntu-azure",
    "description": "Ubuntu is a free, open-source operating system (OS) based on Linux that can be used on desktops, servers, in the cloud, and for IoT devices. Ubuntu is a Linux distribution derived from Debian."
  },
  {
    "name": "ubuntu-gcp",
    "description": "Ubuntu is a free, open-source operating system (OS) based on Linux that can be used on desktops, servers, in the cloud, and for IoT devices. Ubuntu is a Linux distribution derived from Debian."
  },
  {
    "name": "ubuntu-aks",
    "description": "Ubuntu is a free, open-source operating system (OS) based on Linux that can be used on desktops, servers, in the cloud, and for IoT devices. Ubuntu is a Linux distribution derived from Debian."
  },
  {
    "name": "ubuntu-eks",
    "description": "Ubuntu is a free, open-source operating system (OS) based on Linux that can be used on desktops, servers, in the cloud, and for IoT devices. Ubuntu is a Linux distribution derived from Debian."
  },
  {
    "name": "ubuntu-gke",
    "description": "Ubuntu is a free, open-source operating system (OS) based on Linux that can be used on desktops, servers, in the cloud, and for IoT devices. Ubuntu is a Linux distribution derived from Debian."
  },
  {
    "name": "ubuntu-maas",
    "description": "Ubuntu is a free, open-source operating system (OS) based on Linux that can be used on desktops, servers, in the cloud, and for IoT devices. Ubuntu is a Linux distribution derived from Debian."
  },
  {
    "name": "ubuntu-edge",
    "description": "Ubuntu is a free, open-source operating system (OS) based on Linux that can be used on desktops, servers, in the cloud, and for IoT devices. Ubuntu is a Linux distribution derived from Debian."
  },
  {
    "name": "ubuntu-openstack",
    "description": "Ubuntu is a free, open-source operating system (OS) based on Linux that can be used on desktops, servers, in the cloud, and for IoT devices. Ubuntu is a Linux distribution derived from Debian."
  },
  {
    "name": "ubuntu-vsphere",
    "description": "Ubuntu is a free, open-source operating system (OS) based on Linux that can be used on desktops, servers, in the cloud, and for IoT devices. Ubuntu is a Linux distribution derived from Debian."
  },
  {
    "name": "edge-native-ubuntu",
    "description": "Ubuntu is a free, open-source operating system (OS) based on Linux that can be used on desktops, servers, in the cloud, and for IoT devices. Ubuntu is a Linux distribution derived from Debian."
  },
  {
    "name": "unctl",
    "description": "unctl is a versatile command-line tool designed to perform a wide range of checks and inspections on various components of your infrastructure. It provides a unified interface to assess the health and performance of different services and platforms, and goes beyond mere diagnosis."
  },
  {
    "name": "vault",
    "description": "Vault is a tool developed by HashiCorp that helps organizations manage and protect sensitive data and secrets. It uses identity-based security to authenticate and authorize access to secrets, such as passwords, API keys, and encryption keys, using authentication and authorization methods. Vault also protects data in-transit and at rest, and can help prevent credential exposure and unauthorized users."
  },
  {
    "name": "velero",
    "description": "Velero is an open source tool to safely backup and restore, perform disaster recovery, and migrate Kubernetes cluster resources and persistent volumes."
  },
  {
    "name": "vm-migration-assistant",
    "description": "The Virtual Machine Migration Assistant pack lets you migrate your VMs from VMware vSphere to your Virtual Machine Orchestrator (VMO) cluster. You can deploy VM Migration Assistant as an add-on cluster profile on top of an existing cluster with the Virtual Machine Orchestrator (VMO) pack installed."
  },
  {
    "name": "virtual-machine-orchestrator",
    "description": "The Palette Virtual Machine Orchestrator (VMO) pack consolidates all components that you need to deploy and manage Virtual Machines (VMs) alongside containers in a Kubernetes host cluster. You can deploy VMO as an add-on cluster profile on top of an existing data center or edge cluster."
  },
  {
    "name": "volume-snapshot-controller",
    "description": "The Volume Snapshot Controller is a Kubernetes controller that can take snapshots of a persistent volume. A snapshot can be used either to rehydrate a new volume, pre-populated with the snapshot data, or to restore an existing volume to a previous state (represented by the snapshot)."
  },
  {
    "name": "wordpress-chart",
    "description": "WordPress is an open-source web content management system. It was originally created as a tool to publish blogs but has evolved to support publishing other web content, including more traditional websites, mailing lists and Internet forum, media galleries, membership sites, learning management systems, and online stores. "
  },
  {
    "name": "openobserve",
    "description": "OpenObserve is a free, open-source observability platform that unifies logs, metrics, and traces for monitoring applications and infrastructure, and can be deployed on-premises or in the cloud."
  },
  {
    "name": "piraeus-csi",
    "description": "Piraeus Operator is a free, open-source Kubernetes storage solution that deploys and manages LINSTOR clusters. It exposes dynamic provisioning of persistent volumes and snapshots to applications on-premises or in the cloud."
  },
  {
    "name": "piraeus-operator",
    "description": "Piraeus Operator is a free, open-source Kubernetes storage solution that deploys and manages LINSTOR clusters. It exposes dynamic provisioning of persistent volumes and snapshots to applications on-premises or in the cloud."
  },
  {
    "name": "csi-piraeus-operator",
    "description": "Piraeus Operator is a free, open-source Kubernetes storage solution that deploys and manages LINSTOR clusters. It exposes dynamic provisioning of persistent volumes and snapshots to applications on-premises or in the cloud."
  },
  {
    "name": "piraeus-operator-addon",
    "description": "Piraeus Operator is a free, open-source Kubernetes storage solution that deploys and manages LINSTOR clusters. It exposes dynamic provisioning of persistent volumes and snapshots to applications on-premises or in the cloud."
  }
]
