[
  {
    "name": "centos",
    "description": "CentOS Linux distribution is a stable, predictable, manageable and reproducible platform derived from the sources of RedHat Enterprise Linux (RHEL). It provides a rich base platform for open source communities to build upon. Spectro Cloudprovides CentOS as a development framework for its users."
  },
  {
    "name": "cni-flannel",
    "description": "Flannel is a network layer, layer three, fabric for Kubernetes. It is designed to work with Linux routing infrastructure and creates a virtual network that gives each computing host a subnet. Flannel uses either the Kubernetes API or etcd directly to store the network configuration, the allocated subnets, and any auxiliary data such as the host’s public IP address."
  },
  {
    "name": "cni-cilium",
    "description": "The Cilium agent runs on all clusters and servers to provide networking, security and observability to the workload running on that node."
  },
  {
    "name": "csi-rook",
    "description": "Rook is a cloud-native storage orchestrator for Kubernetes, providing the platform, framework, and support for a diverse set of storage solutions to natively integrate with cloud-native environments. Rook turns storage"
  },
  {
    "name": "hello-universe",
    "description": "Hello Universe is a demo web application used to help users learn more about Palette and its features. It includes a click counter and funny Spectro Cloud-themed images."
  },
  {
    "name": "cost-analyzer",
    "description": "Kubecost is a cost monitoring and optimization application that offers real-time cost visibility and insights for Kubernetes clusters."
  },
  {
    "name": "aws-cluster-autoscaler",
    "description": "The AWS Cluster Autoscaler pack monitors the cluster workload and utilizes AWS autoscaling groups to dynamically provision or shut down nodes, maximizing the cluster's performance and making it more resilient to failures."
  },
  {
    "name": "crossplane",
    "description": "Crossplane transforms Kubernetes clusters into universal control planes, extending the Kubernetes API and enabling infrastructure resource provisioning and management across major infrastructure providers."
  },
  {
    "name": "kubernetes-microk8s",
    "description": "MicroK8s is a lightweight Kubernetes distribution developed by Canonical. It deploys all Kubernetes services in a single, fully contained package and offers out-of-the-box add-ons."
  },
  {
    "name": "edge-microk8s",
    "description": "MicroK8s is a lightweight Kubernetes distribution developed by Canonical. It deploys all Kubernetes services in a single, fully contained package and offers out-of-the-box add-ons."
  },
  {
    "name": "lb-metallb",
    "description": "MetalLB is a load balancer implementation for bare metal Kubernetes clusters that use standard routing protocols."
  },
  {
    "name": "lb-metallb-helm",
    "description": "MetalLB is a load balancer implementation for bare metal Kubernetes clusters that use standard routing protocols."
  },
  {
    "name": "ngrok-ingress-controller",
    "description": "The ngrok Ingress Controller provides secure internet access to Kubernetes workloads by offloading network ingress and middleware execution to ngrok's platform."
  },
  {
    "name": "nutanix-csi",
    "description": "The Nutanix CSI pack uses Nutanix Volumes and Nutanix Files to provide persistent storage for stateful applications."
  },
  {
    "name": "argo-cd",
    "description": "Argo CD is a declarative continuous delivery tool for Kubernetes. It automates the deployment of the desired application states in the specified target environments using Git repositories as the source of truth."
  },
  {
    "name": "cni-cilium-oss",
    "description": "Cilium is an open-source software for securing and observing network connectivity between cloud-native container workloads."
  },
  {
    "name": "cni-cilium",
    "description": "Cilium is an open-source software for securing and observing network connectivity between cloud-native container workloads."
  },
  {
    "name": "edge-k3s",
    "description": "K3s is a lightweight distribution of Kubernetes that is specifically designed for resource-constrained environments and Internet of Things (IoT) applications."
  },
  {
    "name": "edge-k8s",
    "description": "Palette eXtended Kubernetes - Edge (PXK-E) is a customized version of the open-source Cloud Native Computing Foundation (CNCF) distribution of Kubernetes. This Kubernetes distribution is customized and optimized for edge computing environments and can be deployed through Palette."
  },
  {
    "name": "edge-native-byoi",
    "description": "The Bring Your Own Operating System (BYOOS) pack enables you to use a custom Operating System (OS) with Palette Edge clusters."
  },
  {
    "name": "generic-byoi",
    "description": "The Bring Your Own Operating System (BYOOS) pack enables you to use a custom Operating System (OS) with Palette clusters."
  },
  {
    "name": "harbor-edge-native-config",
    "description": "Harbor is an open-source registry that secures artifacts with policies and role-based access control. You can install Harbor on your Edge clusters and use it to store all the images used by the cluster, including your provider images and packs."
  },
  {
    "name": "harbor",
    "description": "Harbor is an open-source registry that secures artifacts with policies and role-based access control. You can install Harbor on your clusters and use it to store all the images and packs used by the cluster."
  },
  {
    "name": "nginx",
    "description": "The NGNIX pack is an Ingress Controller implementation that uses NGINX as a reverse proxy and load balancer. It provides services with externally reachable URLs, offers SSL/TLS termination, load balances traffic, and supports name-based virtual hosting."
  }
]
